In [4]:
import numpy as np
import pandas as pd

In [5]:
arr = np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,11]]) #not a number or missing data

In [6]:
arr

array([[10., 20., nan],
       [ 5., nan, nan],
       [21., nan, 11.]])

In [7]:
df = pd.DataFrame(arr,index = ["A","B","C"],columns = ["Column1","Column2","Column3"])

In [6]:
df

   Column1  Column2  Column3
A     10.0     20.0      NaN
B      5.0      NaN      NaN
C     21.0      NaN     11.0

In [8]:
df.dropna(axis = 1)

   Column1
A     10.0
B      5.0
C     21.0

In [9]:
df

   Column1  Column2  Column3
A     10.0     20.0      NaN
B      5.0      NaN      NaN
C     21.0      NaN     11.0

In [10]:
df.dropna(thresh = 2)  #minimum 2 number

   Column1  Column2  Column3
A     10.0     20.0      NaN
C     21.0      NaN     11.0

In [11]:
df.fillna(value = 1)

   Column1  Column2  Column3
A     10.0     20.0      1.0
B      5.0      1.0      1.0
C     21.0      1.0     11.0

In [12]:
df.fillna(value = 1,inplace=False)

   Column1  Column2  Column3
A     10.0     20.0      1.0
B      5.0      1.0      1.0
C     21.0      1.0     11.0

In [13]:
df

   Column1  Column2  Column3
A     10.0     20.0      NaN
B      5.0      NaN      NaN
C     21.0      NaN     11.0

In [14]:
df.fillna(value = 100,inplace=False)

   Column1  Column2  Column3
A     10.0     20.0    100.0
B      5.0    100.0    100.0
C     21.0    100.0     11.0

In [15]:
df.sum()

Column1    36.0
Column2    20.0
Column3    11.0
dtype: float64

In [16]:
df.sum().sum()

67.0

In [8]:
df.size

9

In [12]:
df.isnull()

   Column1  Column2  Column3
A    False    False     True
B    False     True     True
C    False     True    False

In [13]:
df

   Column1  Column2  Column3
A     10.0     20.0      NaN
B      5.0      NaN      NaN
C     21.0      NaN     11.0

In [15]:
print(df.isnull().sum())

Column1    0
Column2    2
Column3    2
dtype: int64

In [16]:
print(df.isnull().sum().sum())

4

In [17]:
def calculateMean(df):
    total_sum = df.sum().sum()
    totalNum = df.size - df.isnull().sum().sum()
    return total_sum / totalNum

In [18]:
df.fillna(value = calculateMean(df))

   Column1  Column2  Column3
A     10.0     20.0     13.4
B      5.0     13.4     13.4
C     21.0     13.4     11.0